배치 솔루션 개선작업에 대한 회고....

## 발단

구조개선의 필요

## 원본소스가 가진 문제점

### JDBC 데이터 추출과 하드코딩된 SQL들

### 통짜로 쓰여진 Service와 가독성이 떨어지는 코드들, 그리고 Jsch라이브러리의 제공 중단으로 OpenSSH를 사용할 수 없게 된 점

### 타 서버 장애 전파를 어떻게 핸들링 할 것인지?

### schema 구성의 문제점 Adapter가 사실은 배치작업 Detail 이라던지? 

### 스케쥴링의 문제점과 다음 작업 실행을 계산하는 로직이 로그테이블을 Join하고 있어 문제가 되었던 내용

### Queue Produce Consume -> 딱히 문제라고 생각하지는 않았으나 Quartz Scheduler의 Clustered 설정을 이용하기로 결정

## 어떤 순서로 개선을 진행 할 것인지? 그리고 어떤 방향으로 개선할 것인지?

### schema 구조 개선 및 확립

### 하드코딩 SQL을 JPA화 (간단한 Rule 정보를 가지고 기동하기 때문에 복잡한 쿼리는 없었음 관계만 잘 지정해주면 Entity를 사용하면 되는 수준)

### 단위 테스트 작성 ( 배치솔루션이 요구하는 기능을 중심으로 작성 )

### 어댑터 Advisor 레이어 도입 ( 타 SFTP 및 DbConnection간의 연결을 핸들링하고 장애전파를 막기 위함, 이 과정에서 SFTP Conneciton Pool도 구현을 생각 해 봤지만, 작업하지 않은 이유 )

### Service 구조 설립, -> 여기서 중점으로 둔 것은 추가 Custom Batch Type이 필요하게 되었을 시, 어떻게 코드상으로 대응 할 수 있는가?? 

 구체적으로 특정 사이트에서는 File to File 배치를 실행하기 이전에 File을 특정 모듈로 복호화 해야 하는 과정이 필요하다거나, File 적재 완료 후 Http Call Event를 발생해 주어야 하는 상황이 있다는 가정 하에 진행

### 배치의 확장 (1:N 배치, Process 체이닝)

### Spring Batch의 도입 검토 ( 왜 처음부터 이런 추상화 도구를 이용하지 않았느냐??? ---> 하지 말라 했기 때문 ㅎ... 쩝)

### 어떻게 4GB 메모리 환경에서 16GB 파일을 배치처리 하게 변경하였는지??

당연히.. 그냥 Stream을 꽃아서.. 상식적으로 대용량 파일 처리 readAllLines 합니까
+ 추가로 어떻게 더 빠른 대용량 파일 처리를 

### D2F, F2D 처리시 Chunk 기반으로 구성 ( Spring Batch로의 이식성 고려)
